[
  {
    "company": "Everything Green Limited",
    "role": "Full Stack Developer",
    "logo": "/images/everything-green-limited.ico",
    "startDate": "February 2026",
    "endDate": "Present",
    "responsibilities": [
      "Developed and maintained scalable full-stack web applications using Next.js and Express.js, with responsive UI built using Tailwind CSS, Bootstrap, and SASS.",
      "Managed application state and server-side data synchronization using Zustand and TanStack Query for efficient, reactive user experiences.",
      "Integrated third-party services including Stripe for payment processing, Cloudinary for media management, and NodeMailer for transactional email delivery.",
      "Designed and managed relational and non-relational database schemas using PostgreSQL and Mongoose (MongoDB), with Prisma as the ORM for type-safe database interactions.",
      "Leveraged ClickHouse for high-performance analytical queries and large-scale data processing.",
      "Implemented robust data validation and API security using Zod and CORS, ensuring reliable and secure client-server communication.",
      "Containerized applications using Docker for consistent development, testing, and production environments."
    ]
  },
  {
    "company": "Synchronise It",
    "role": "Software Developer",
    "logo": "/images/synchronise-it.png",
    "startDate": "November 2024",
    "endDate": "December 2025",
    "responsibilities": [
      "Developed and maintained scalable web applications using Next.js and Laravel, utilizing Tailwind CSS for responsive, modern UI design.",
      "Integrated secure third-party financial services, specifically implementing the Paymob payment gateway for seamless transaction processing.",
      "Managed server infrastructure and deployment on Hostinger VPS (Debian OS), configuring Nginx as a reverse proxy and PM2 for process management.",
      "Designed and optimized complex database schemas using MySQL to ensure data integrity and query performance.",
      "Collaborated with cross-functional teams to deliver high-quality software, ensuring faultless user experiences through rigorous testing."
    ]
  },
  {
    "company": "Synchronise It",
    "role": "Software Developer Trainee",
    "logo": "/images/synchronise-it.png",
    "startDate": "March 2024",
    "endDate": "October 2024",
    "responsibilities": [
      "Assisting in the development of web applications using modern technologies.",
      "Collaborating with senior developers to fix bugs and implement new features.",
      "Writing clean, efficient, and maintainable code.",
      "Participating in code reviews and team meetings.",
      "Contributing to the design and architecture of software solutions."
    ]
  },
  {
    "company": "Self-Employed",
    "role": "ICT & Math Teacher",
    "startDate": "February 2019",
    "endDate": "Present",
    "responsibilities": [
      "Conducting online tutoring sessions for ICT and Math subjects.",
      "Customizing lesson plans to meet the needs of virtual learners.",
      "Utilizing digital tools and resources to enhance learning experiences.",
      "Providing timely feedback and support to students through online platforms.",
      "Monitoring student progress and adjusting teaching strategies as needed."
    ]
  }
]